<?php
//Дано: 
$user = array(
    'first_name' => 'Владимир'
    , 'last_name' => 'Романичев'
    , 'email' => 'email@email.com'
    , 'password' => '123456'

);

/**
 * 
    Вывести имя
    Вывести почту
    Поменять пароль на 128
    Вывести на страницу все значения с новой строки кроме пароля.
    Вывести на страницу все ключи массива с новой строки
    Поменять имя пользователя на Петр, вывести новое Имя и Фамилию через пробел
    Сравнить пароль пользователя с паролем 34234, если пароли не совпадают вывести соответствующий текст
 */